app/Controllers/TodosController.php

INSERT INTO `todos` (`title`, `description`) VALUES ('Sarma Dolma', '30 derecelik fırında')
---
    public function add()
    {
        $title=$this->request->getVar('title');
        $description=$this->request->getVar('description');

        $data=[
            'title'=>$title,
            'description'=>$description
        ];

        $result= $this->todosModel->insert($data);